src/cf/InformationRegisters/HotelBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>HotelBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/HotelBookingHistory/Forms/ReservationForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	CheckinDate = CurrentDate();
	FillReservationForm();
EndProcedure

&AtServer
Procedure FillReservationForm()
	
	Var NewRow, Query, QueryResult, SelectionDetailRecords;
	ReservedRooms.Clear();
	Query = New Query;
	Query.Text = 
	"SELECT
	|	HotelBookingHistory.Room AS Room,
	|	HotelBookingHistory.StartTime AS StartTime,
	|	HotelBookingHistory.EndTime AS EndTime,
	|	HotelBookingHistory.DogOwner AS DogOwner,
	|	HotelBookingHistory.Dog AS Dog
	|FROM
	|	InformationRegister.HotelBookingHistory AS HotelBookingHistory";
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		NewRow = ReservedRooms.Add();
		NewRow.Room = SelectionDetailRecords.Room;
		NewRow.Customer = SelectionDetailRecords.DogOwner;
		NewRow.Dog = SelectionDetailRecords.Dog;
		NewRow.Checkin = SelectionDetailRecords.StartTime;
		NewRow.CheckOut = SelectionDetailRecords.EndTime;
	EndDo;

EndProcedure

&AtClient
Procedure Check(Command)
	CheckAtServer();
EndProcedure

&AtServer
Procedure CheckAtServer()
	ReservedRooms.Clear();
	If ValueIsFilled(CheckinDate) and ValueIsFilled(Room) then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	HotelBookingHistory.Room AS Room,
		|	HotelBookingHistory.Dog AS Dog,
		|	HotelBookingHistory.DogOwner AS DogOwner,
		|	HotelBookingHistory.EndTime AS EndTime,
		|	HotelBookingHistory.StartTime AS StartTime
		|FROM
		|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
		|WHERE
		|	HotelBookingHistory.Room = &Room
		|	AND &CheckinDate BETWEEN HotelBookingHistory.StartTime AND HotelBookingHistory.EndTime";
		
		Query.SetParameter("CheckinDate", CheckinDate);
		Query.SetParameter("Room", Room);
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		
		While SelectionDetailRecords.Next() Do
			NewRow = ReservedRooms.Add();
			NewRow.Room = SelectionDetailRecords.Room;
			NewRow.Customer = SelectionDetailRecords.DogOwner;
			NewRow.Dog = SelectionDetailRecords.Dog;
			NewRow.Checkin = SelectionDetailRecords.StartTime;
			NewRow.CheckOut = SelectionDetailRecords.EndTime;
		EndDo;
	Elsif ValueIsFilled(CheckinDate) then
		 	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	HotelBookingHistory.Dog AS Dog,
		|	HotelBookingHistory.DogOwner AS DogOwner,
		|	HotelBookingHistory.Room AS Room,
		|	HotelBookingHistory.StartTime AS StartTime,
		|	HotelBookingHistory.EndTime AS EndTime
		|FROM
		|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
		|WHERE
		|	&CheckinDate BETWEEN HotelBookingHistory.StartTime AND HotelBookingHistory.EndTime";
	
	Query.SetParameter("CheckinDate", CheckinDate);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		NewRow = ReservedRooms.Add();
		NewRow.Room = SelectionDetailRecords.Room;
		NewRow.Customer = SelectionDetailRecords.DogOwner;
		NewRow.Dog = SelectionDetailRecords.Dog;
		NewRow.Checkin = SelectionDetailRecords.StartTime;
		NewRow.CheckOut = SelectionDetailRecords.EndTime;
	EndDo;
Elsif ValueIsFilled(Room) then
	Query = New Query;
	Query.Text = 
		"SELECT
		|	HotelBookingHistory.Dog AS Dog,
		|	HotelBookingHistory.DogOwner AS DogOwner,
		|	HotelBookingHistory.Room AS Room,
		|	HotelBookingHistory.EndTime AS EndTime,
		|	HotelBookingHistory.StartTime AS StartTime
		|FROM
		|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
		|WHERE
		|	HotelBookingHistory.Room = &Room";
	
	Query.SetParameter("Room", Room);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		NewRow = ReservedRooms.Add();
		NewRow.Room = SelectionDetailRecords.Room;
		NewRow.Customer = SelectionDetailRecords.DogOwner;
		NewRow.Dog = SelectionDetailRecords.Dog;
		NewRow.Checkin = SelectionDetailRecords.StartTime;
		NewRow.CheckOut = SelectionDetailRecords.EndTime;
	EndDo;
	
	Else FillReservationForm();	
	Endif;
EndProcedure
